## Production
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                        RESOURCE                         |
|----------|---------------------------------------------------------|
| update   | `module.celery_worker_ecs.aws_ecs_service.this`         |
| recreate | `module.celery_worker_ecs.aws_ecs_task_definition.this` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.celery_worker_ecs.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ca-central-1:066023111852:service/superset/celery-worker"
        name                               = "celery-worker"
        tags                               = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker:1" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.celery_worker_ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker:1" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ca-central-1:066023111852:task-definition/celery-worker" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu                    = 0
                  - essential              = true
                  - mountPoints            = []
                    name                   = "celery-worker"
                  - volumesFrom            = []
                    # (8 unchanged attributes hidden)
                },
            ]
        )
      ~ cpu                      = "1024" -> "512" # forces replacement
      ~ id                       = "celery-worker" -> (known after apply)
      ~ memory                   = "2048" -> "1024" # forces replacement
      ~ revision                 = 1 -> (known after apply)
        tags                     = {
            "CostCentre" = "cds-superset-prod"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_glue_crawler.cur_data_extract"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.glue_s3_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.glue_crawler"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.superset_athena_read"]
WARN - plan.json - main - Missing Common Tags: ["module.superset-redis.aws_elasticache_subnet_group.default"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
